#! /bin/bash


#######################################
#
# 	Функция преобразования двоично-десятичной формы маски подсети в нотацию CIDR
#
#	Входные параметры:
#
#	маска подсети в двоично-десятичной форме (255.255.255.255)
#
#	Возвращаемое значение:
#
#	маска подсети в нотации CIDR (32)
#
#######################################

function netmask2cidr() {
	if echo "$1" | grep -P "^(?:\d{1,2}|1\d\d|2[0-4]\d|25[0-5])(?:\.(?:\d{1,2}|1\d\d|2[0-4]\d|25[0-5])){3}$" >/dev/null; then
		local x=${1##*255.}
		set -- 0^^^128^192^224^240^248^252^254^ $(( (${#1} - ${#x})*2 )) ${x%%.*}
		x=${1%%$3*}
		echo $(( $2 + (${#x}/4) ))
	else
		echo $1
	fi
}
